<a href="https://colab.research.google.com/github/easgarli/datascience_bootcamp/blob/main/Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
import pandas as pd
import numpy as np

In [3]:
pd.__version__

'2.0.3'

In [8]:
y = np.array([1,2,3])

In [10]:
z =pd.Series(y)

In [11]:
type(z)

pandas.core.series.Series

In [17]:
z.index=['a','b','c']

In [19]:
z.columns[num]
z

AttributeError: 'Series' object has no attribute 'columns'

In [21]:
pd.concat([z,z])

a    1
b    2
c    3
a    1
b    2
c    3
dtype: int64

In [24]:
df = pd.DataFrame({"a":[1,2,3], "b":[4,5,6]})

In [25]:
df

   a  b
0  1  4
1  2  5
2  3  6

In [25]:
a={"name":["d",1,2,5], "surname":["gg","hhh","yyy","%ghh"]}
b=["A","B","C","D"]
df_1 = pd.DataFrame(data=a,index=b)
df_1

  name surname
A    d      gg
B    1     hhh
C    2     yyy
D    5    %ghh

In [26]:
df_1["city"] = ['Baku','Sumqayit','New York','Qazax']

In [27]:
df_1

  name surname      city
A    d      gg      Baku
B    1     hhh  Sumqayit
C    2     yyy  New York
D    5    %ghh     Qazax

In [28]:
df_1[0:2]

  name surname      city
A    d      gg      Baku
B    1     hhh  Sumqayit

In [29]:
df_1[1:]

  name surname      city
B    1     hhh  Sumqayit
C    2     yyy  New York
D    5    %ghh     Qazax

In [30]:
df_1['name']=['Elnur','Meded','Zahir','Mahir']

In [31]:
df_1

    name surname      city
A  Elnur      gg      Baku
B  Meded     hhh  Sumqayit
C  Zahir     yyy  New York
D  Mahir    %ghh     Qazax

In [32]:
df_1.rename(columns={'surname':'Surname'},index={'A':'A-1'},inplace=True)

In [33]:
df_1

      name Surname      city
A-1  Elnur      gg      Baku
B    Meded     hhh  Sumqayit
C    Zahir     yyy  New York
D    Mahir    %ghh     Qazax

In [34]:
new_columns = df_1['name'].values

In [35]:
df_1[new_columns] = pd.NA

In [36]:
df_1

      name Surname      city Elnur Meded Zahir Mahir
A-1  Elnur      gg      Baku  <NA>  <NA>  <NA>  <NA>
B    Meded     hhh  Sumqayit  <NA>  <NA>  <NA>  <NA>
C    Zahir     yyy  New York  <NA>  <NA>  <NA>  <NA>
D    Mahir    %ghh     Qazax  <NA>  <NA>  <NA>  <NA>

In [37]:
df_1['name']['A-1']

'Elnur'

In [39]:
for row in df_1.index:
    for column in df_1.columns:
        if df_1['name'][row] == column:
            df_1[column][row]= "XXXX"
df_1

      name Surname      city Elnur Meded Zahir Mahir
A-1  Elnur      gg      Baku  XXXX  <NA>  <NA>  <NA>
B    Meded     hhh  Sumqayit  <NA>  XXXX  <NA>  <NA>
C    Zahir     yyy  New York  <NA>  <NA>  XXXX  <NA>
D    Mahir    %ghh     Qazax  <NA>  <NA>  <NA>  XXXX

In [4]:
series = pd.Series(list("techproeducation"))
series

0     t
1     e
2     c
3     h
4     p
5     r
6     o
7     e
8     d
9     u
10    c
11    a
12    t
13    i
14    o
15    n
dtype: object

In [5]:
series.sort_index(ascending=False)

15    n
14    o
13    i
12    t
11    a
10    c
9     u
8     d
7     e
6     o
5     r
4     p
3     h
2     c
1     e
0     t
dtype: object

In [6]:
series.sort_values()

11    a
2     c
10    c
8     d
1     e
7     e
3     h
13    i
15    n
6     o
14    o
4     p
5     r
0     t
12    t
9     u
dtype: object

In [7]:
series.isin(["o"])

0     False
1     False
2     False
3     False
4     False
5     False
6      True
7     False
8     False
9     False
10    False
11    False
12    False
13    False
14     True
15    False
dtype: bool

In [8]:
series.keys()

RangeIndex(start=0, stop=16, step=1)

In [9]:
series.values

array(['t', 'e', 'c', 'h', 'p', 'r', 'o', 'e', 'd', 'u', 'c', 'a', 't',
       'i', 'o', 'n'], dtype=object)

In [10]:
series.items()

In [11]:
list(series.items())

[(0, 't'),
 (1, 'e'),
 (2, 'c'),
 (3, 'h'),
 (4, 'p'),
 (5, 'r'),
 (6, 'o'),
 (7, 'e'),
 (8, 'd'),
 (9, 'u'),
 (10, 'c'),
 (11, 'a'),
 (12, 't'),
 (13, 'i'),
 (14, 'o'),
 (15, 'n')]

In [13]:
df = pd.DataFrame(np.arange(1,59,3).reshape(5,4), columns=['var1','var2','var3','var4'])
df

   var1  var2  var3  var4
0     1     4     7    10
1    13    16    19    22
2    25    28    31    34
3    37    40    43    46
4    49    52    55    58

In [14]:
df.tail(1)

   var1  var2  var3  var4
4    49    52    55    58

In [15]:
df.head(1)

   var1  var2  var3  var4
0     1     4     7    10

In [20]:
df.sample(n=2)

   var1  var2  var3  var4
1    13    16    19    22
4    49    52    55    58

In [21]:
df.shape

(5, 4)

In [70]:
np.random.seed(101)
df = pd.DataFrame(np.random.randint(9,size=(5,4)), 
                  columns='W X Y Z'.split(),
                  index='A B C D E'.split())
df

   W  X  Y  Z
A  1  6  7  8
B  4  8  5  0
C  5  8  1  3
D  8  3  3  2
E  8  3  7  0

In [52]:
df.index

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

In [53]:
df.columns

Index(['W', 'X', 'Y', 'Z'], dtype='object')

In [49]:
df.shape

(5, 4)

In [48]:
df.size

20

In [45]:
#You can use the len() function to verify the number of rows
len(df)

5

In [57]:
df.axes

[Index(['A', 'B', 'C', 'D', 'E'], dtype='object'),
 Index(['W', 'X', 'Y', 'Z'], dtype='object')]

In [59]:
#df.ndim : Returns an int representing the number of axes / array dimensions.
df.ndim

2

In [71]:
df.reset_index(inplace=True)

In [72]:
df

  index  W  X  Y  Z
0     A  1  6  7  8
1     B  4  8  5  0
2     C  5  8  1  3
3     D  8  3  3  2
4     E  8  3  7  0

In [77]:
newindx = 'CA NY WY OR CO'.split()
df['newidx'] = newindx
df = df.set_index('newidx')
df

        W  X  Y  Z
newidx
CA      1  6  7  8
NY      4  8  5  0
WY      5  8  1  3
OR      8  3  3  2
CO      8  3  7  0

In [75]:
df.drop(columns=['index'],inplace=True)
df

   W  X  Y  Z newidx
0  1  6  7  8     CA
1  4  8  5  0     NY
2  5  8  1  3     WY
3  8  3  3  2     OR
4  8  3  7  0     CO

In [79]:
new_order = 'W	X	Z	Y'.split()
df = df[new_order]
df

        W  X  Z  Y
newidx
CA      1  6  8  7
NY      4  8  0  5
WY      5  8  3  1
OR      8  3  2  3
CO      8  3  0  7

In [82]:
df.loc['CA','Z']

8

In [83]:
df[df['W']>4]

        W  X  Z  Y
newidx
WY      5  8  3  1
OR      8  3  2  3
CO      8  3  0  7

In [90]:
df.iloc[2:,2:]

        Z  Y
newidx
WY      3  1
OR      2  3
CO      0  7

In [91]:
import seaborn as sns

In [92]:
df = sns.load_dataset('penguins')

In [93]:
df.head()

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,Male
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,Female
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,Female
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,Female

In [94]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 344 entries, 0 to 343
Data columns (total 7 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   species            344 non-null    object
 1   island             344 non-null    object
 2   bill_length_mm     342 non-null    float64
 3   bill_depth_mm      342 non-null    float64
 4   flipper_length_mm  342 non-null    float64
 5   body_mass_g        342 non-null    float64
 6   sex                333 non-null    object
dtypes: float64(4), object(3)
memory usage: 18.9+ KB

In [95]:
df.describe()

       bill_length_mm  bill_depth_mm  flipper_length_mm  body_mass_g
count      342.000000     342.000000         342.000000   342.000000
mean        43.921930      17.151170         200.915205  4201.754386
std          5.459584       1.974793          14.061714   801.954536
min         32.100000      13.100000         172.000000  2700.000000
25%         39.225000      15.600000         190.000000  3550.000000
50%         44.450000      17.300000         197.000000  4050.000000
75%         48.500000      18.700000         213.000000  4750.000000
max         59.600000      21.500000         231.000000  6300.000000

In [96]:
df.shape

(344, 7)

In [97]:
len(df)

344

In [116]:
df.island.value_counts(normalize=True)

island
Biscoe       0.488372
Dream        0.360465
Torgersen    0.151163
Name: proportion, dtype: float64

In [105]:
df.bill_depth_mm.mean()

17.151169590643278

In [106]:
df.bill_depth_mm.sum()

5865.700000000001

In [107]:
df.species.unique()

array(['Adelie', 'Chinstrap', 'Gentoo'], dtype=object)

In [109]:
df.isnull().sum()

species               0
island                0
bill_length_mm        2
bill_depth_mm         2
flipper_length_mm     2
body_mass_g           2
sex                  11
dtype: int64

In [115]:
df.drop(columns=['bill_length_mm'])

    species     island  bill_depth_mm  flipper_length_mm  body_mass_g     sex
0    Adelie  Torgersen           18.7              181.0       3750.0    Male
1    Adelie  Torgersen           17.4              186.0       3800.0  Female
2    Adelie  Torgersen           18.0              195.0       3250.0  Female
3    Adelie  Torgersen            NaN                NaN          NaN     NaN
4    Adelie  Torgersen           19.3              193.0       3450.0  Female
..      ...        ...            ...                ...          ...     ...
339  Gentoo     Biscoe            NaN                NaN          NaN     NaN
340  Gentoo     Biscoe           14.3              215.0       4850.0  Female
341  Gentoo     Biscoe           15.7              222.0       5750.0    Male
342  Gentoo     Biscoe           14.8              212.0       5200.0  Female
343  Gentoo     Biscoe           16.1              213.0       5400.0    Male

[344 rows x 6 columns]

In [112]:
df

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,Male
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,Female
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,Female
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,Female
...,...,...,...,...,...,...,...
339,Gentoo,Biscoe,NaN,NaN,NaN,NaN,NaN
340,Gentoo,Biscoe,46.8,14.3,215.0,4850.0,Female
341,Gentoo,Biscoe,50.4,15.7,222.0,5750.0,Male
342,Gentoo,Biscoe,45.2,14.8,212.0,5200.0,Female
343,Gentoo,Biscoe,49.9,16.1,213.0,5400.0,Male

In [124]:
df['bill_depth_mm'] = (df['bill_depth_mm']/df['bill_depth_mm'].sum())*100
df['bill_depth_mm']

0      0.318803
1      0.296640
2      0.306869
3           NaN
4      0.329031
         ...
339         NaN
340    0.243790
341    0.267658
342    0.252314
343    0.274477
Name: bill_depth_mm, Length: 344, dtype: float64

In [125]:
df = sns.load_dataset("iris")
df.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [130]:
df.groupby("species")[["petal_width"]].sum()

            petal_width
species
setosa             12.3
versicolor         66.3
virginica         101.3

In [131]:
d = {'batch': ['A','B','C','A','B','C'], 'var1':[10,23,33,22,11,99],'var2':[100,253,333,262,111,969]}
df = pd.DataFrame(data=d)
df

  batch  var1  var2
0     A    10   100
1     B    23   253
2     C    33   333
3     A    22   262
4     B    11   111
5     C    99   969

In [132]:
df.groupby('batch').aggregate([np.min,np.median,np.max])

      var1             var2
      amin median amax amin median amax
batch
A       10   16.0   22  100  181.0  262
B       11   17.0   23  111  182.0  253
C       33   66.0   99  333  651.0  969

In [133]:
df.groupby('batch').transform(lambda x: x.mean())

   var1   var2
0  16.0  181.0
1  17.0  182.0
2  66.0  651.0
3  16.0  181.0
4  17.0  182.0
5  66.0  651.0